app/Http/Controllers/Auth/AuthController.php

insert into `users` (`name`, `email`, `password`, `type`, `updated_at`, `created_at`) values ('hussien', 'hussien@gmail.com', '$2y$12$zkMAvdhsv0ZfJuunZGRGmejFOuRw4gFijVraPMGAiAuW3mp1hU6xq', 'job_seeker', '2025-03-14 14:06:23', '2025-03-14 14:06:23')
insert into `users` (`name`, `email`, `role`, `password`, `updated_at`, `created_at`) values ('hussien', 'hussien@gmail.com', 'job_seeker', '$2y$12$Jjmpu0mF28Zs/bYqfTNhbO.Uhyoco9DvtjKv7PafRz5F4J0nqzvoa', '2025-03-17 07:38:09', '2025-03-17 07:38:09')
---
    public function register(Request $request)
    {

        $validated = Validator::make($request->all(), [
            'name' => 'required|string|max:255',
            'email' => 'required|string|email|max:255|unique:users',
            'password' => 'required|string|min:6|confirmed',
            'password_confirmation' => 'required|string|min:6|same:password',
            'type' => 'required|string|in:employer,job_seeker'
        ]);

        if( $validated->fails()){
            return response()->json([
                'errors' =>$validated->errors(),
            ],422);
        }

        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
            'type' => $request->type
        ]);
        $token = $user->createToken('auth_token')->plainTextToken;

select * from `users` where `email` = 'ali@gmail.com' limit 1
---
    public function login(Request $request){
        $validated = Validator::make($request->all(), [
            'email' => 'required|string|email|max:255',
            'password' => 'required|string|min:6',
        ]);
        if( $validated->fails()){
            return response()->json(['errors'=>$validated->errors()],422);
        }

        $user = User::where('email',$request->email)->first();