app/Http/Controllers/Api/ApplicationController.php

    public function show(Application $application)
    {
        $user = auth()->user();

        if(!$user || $user->role !== 'job_seeker'){
            return response()->json(['error' => 'only job_seeker can show their application status'], 401);
        }
        if ($user->id !== $application->user_id){
        $application = Application::where('id',$application->id)->first();
---
select * from `users` where `users`.`id` = 18 limit 1