app/Http/Controllers/Api/ApplicationController.php

    public function store(Request $request, Job  $job)
    {
        $user = auth()->user();
        if(!$user || $user->role !== 'job_seeker'){
            return response()->json(['error' => 'only job_seeker can apply for jobs'], 401);
        }

        $validator = Validator::make($request->all(), [
            'resume_path'=>"required|mimes:pdf,doc,docx,csv,png,jpg,jpeg,svg|max:2048",
            'cover_letter'=>"nullable|string|max:200",
        ]);
        if($validator->fails()){
            return response()->json([
                'errors' => $validator->errors()->all(),
            ],422);
        }
        $resume_path =$request->file('resume_path')->store('resume','public');
        $application = Application::create([
            "user_id"=>auth()->id(),
            'job_id'=>$job->id,
            'resume_path'=>$resume_path,
            'cover_letter'=>$request->cover_letter,
        ]);
---
insert into `applications` (`user_id`, `job_id`, `resume_path`, `cover_letter`, `updated_at`, `created_at`) values (2, 1, 'resume/i1HZdiV6U9OMcOqtlK33YART0u5ZdcINEpHRpkpL.png', 'can help me', '2025-03-20 13:01:51', '2025-03-20 13:01:51')

    public function show(Application $application)
    {
        $user = auth()->user();

        if(!$user || $user->role !== 'job_seeker'){
            return response()->json(['error' => 'only job_seeker can show their application status'], 401);
        }
        if ($user->id !== $application->user_id){
            return response()->json(['error' => 'you are not the owner of this applicaton'], 401);
        }

        $application = Application::where('id',$application->id)->first();
---
select * from `applications` where `id` = 1 limit 1

    public function update(Request $request, Application $application)
    {
        Log::info("start update status",["application_id"=>$application->id]);
        $user = auth()->user();
        $job = $application->job;
        if (!$user || $user->role !=='employer') {
            return response()->json(['error' => 'only employer can update that'], 401);
        }
        if($user->id !== $job->user_id){
            return response()->json(['error' => 'you are not the employer who post this job of this job'], 401);
        }
        $validator = Validator::make($request->all(),rules: array(
            'status' => "required|",[Rule::in(Application::$statuses)]
        ));
        if($validator->fails()){
            return response()->json([
                'errors' => $validator->errors()->all(),
            ]);
        }
        $old_status = $application->status;
        $application->update([
            'status' => $request->status,
        ]);
---
update `applications` set `status` = 'rejected', `applications`.`updated_at` = '2025-03-17 12:44:20' where `id` = 1