app/Http/Controllers/Api/InterviewController.php

select * from `applications` where `applications`.`id` = 1 limit 1
---
    public function store(Request $request)
    {
        $employer = auth()->user();

        $validator = Validator::make($request->all(), [
            'application_id' => 'required',
            'scheduled_at' => 'required|date|after:now',
            'text' => 'nullable|string|max:500',
        ]);

        if ($validator->fails()) {
            return response()->json(['error' => $validator->errors()], 422);
        }

        $application = Application::find($request->application_id);

insert into `interviews` (`application_id`, `employer_id`, `job_seeker_id`, `scheduled_at`, `text`, `updated_at`, `created_at`) values (1, 1, 2, '2025-04-11 10:00:00', null, '2025-03-21 13:28:55', '2025-03-21 13:28:55')
---
            return response()->json(['error' => 'Application has no associated job seeker'], 400);
        }

        $interview = Interview::create([
            'application_id' => $request->application_id,
            "employer_id" => $employer->id,
            'job_seeker_id' => $application->user_id,
            'scheduled_at' => $request->scheduled_at,
            'text' => $request->notes,
        ]);

select * from `interviews` where `interviews`.`id` = 9 limit 1
update `interviews` set `status` = 'rejected', `interviews`.`updated_at` = '2025-03-21 13:38:19' where `id` = 9
---
    public function update(Request $request, Interview $interview)
    {
        $user = auth()->user();

        if($user->id !== $interview->employer_id && $user->id !== $interview->job_seeker_id){
            return response()->json(['error' => 'Unauthorized'], 403);
        }
        $status= Interview::find($interview->id);
//        dd($status);
        if (!$status) {
            return response()->json(['error' => 'Interview not found'], 404);
        }
        $validator = Validator::make($request->all(), [
            'status' => 'required|string|in:accepted,rejected,canceled',
        ]);
        if ($validator->fails()) {
            return response()->json(['error' => $validator->errors()], 422);
        }
        if ($interview->status === 'rejected') {
            return response()->json(['error' => "you can't update canceled interview"], 400);
        }
        $status->update([
            'status' => $request->status,
        ]);