app/Http/Controllers/Api/JobAlertController.php

    public function subscribeToAlerts(Request $request)
    {
        $user = auth()->user();
        if (!$user || $user->role !== 'job_seeker'){
            return response()->json(['error' => 'Unauthorized'], 401);
        }
        $validated = Validator::make($request->all(), [
            'location'=>'required|string|max:255',
            'type'=>'required|string|max:255',
        ]);
        if ($validated->fails()) {
            return response()->json(['error' => $validated->errors()], 400);
        }
        $JobAlert = JobAlert::create([
            'user_id'=> auth()->id(),
            'location'=> $request->location,
            'type'=> $request->type,
        ]);
---
insert into `job_alerts` (`user_id`, `location`, `type`, `updated_at`, `created_at`) values (2, 'germany', 'full_time', '2025-03-18 13:37:10', '2025-03-18 13:37:10')