app/Http/Controllers/Api/JobController.php

select * from `users` where `users`.`id` in (17, 19)
---
    public function index()
    {
        $jobs = Cache::remember('jobs_all',3600,function (){
            return Job::with('user')->get()->toArray();
        });