app/Http/Controllers/Api/MessageController.php

select * from `applications` where `applications`.`id` = 1 limit 1
insert into `messages` (`application_id`, `sender_id`, `receiver_id`, `content`, `updated_at`, `created_at`) values (1, 1, 2, 'okay tommorwo we can do that', '2025-03-18 19:39:42', '2025-03-18 19:39:42')
---
    public function sendMessage(Request $request)
    {
        $user = auth()->user();
        if (!$user) {
            return response()->json(['error' => 'Unauthorized'], 401);
        }
        $validated = Validator::make($request->all(), [
            'application_id' => 'required|exists:applications,id',
            'content' => 'required|string|max:255',
        ]);
        if ($validated->fails()) {
            return response()->json(['error' => $validated->errors()], 400);
        }
        $application = Application::findorfail($request->application_id);
        if (!$application) {
            return response()->json(['error' => 'Application not found'], 404);
        }
        if($user->id !== $application->user_id && $user->id !== $application->job->user_id) {
            return response()->json(['error' => 'Unauthorized'], 401);
        }
        $receiverID = ($user->id === $application->user_id) ? $application->job->user_id : $application->user_id;
        $message = Message::create([
            'application_id' => $request->application_id,
            'sender_id'=>$user->id,
            'receiver_id' => $receiverID,
            'content'=> $request->get('content'),
        ]);

select * from `messages` where `application_id` = 1
---
    public function getMessages(Request $request, Application $application)
    {
        $user = auth()->user();
        $jobUserId = $application->job ? $application->job->user_id : null;
        \Log::info('Auth debug', [
            'user_id' => $user->id,
            'application_user_id' => $application->user_id,
            'job_user_id' => $jobUserId,
        ]);

        if ($user->id !== $application->user_id && ($jobUserId === null || $user->id !== $jobUserId)) {
            return response()->json(['error' => 'Unauthorized'], 403);
        }

        $messages = Message::where('application_id', $application->id)->get();