routes/api.php

        Route::get('{application}/status',[ApplicationController::class, 'show']);
        Route::patch('{application}/update/status',[ApplicationController::class, 'update']);
        Route::get('applications/list', [ApplicationController::class, 'index']);
        Route::get('job-seeker/applications/list', [ApplicationController::class, 'jobSeekerApplication']);
---
select * from `applications` limit 1